### Requirement of the algorithm

 **3. Importing the dataset**

In [12]:
import pandas as pd
movie = pd.read_table(r'http://bit.ly/movieusers', sep = "|", header = None, usecols = [1,3], nrows = 2)
movie.head()

C:\Users\faiza\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead.

    1           3
0  24  technician
1  53       other

In [27]:
season = pd.read_csv(r'C:\\Users\\faiza\\Downloads\\Documents\\dummy.csv')
season.head()

         day   temp  climate  event
0  1/12/2007  32.00      6.0   rain
1  5/15/2003    NaN      NaN  Sunny
2  6/10/2006  33.00      7.0   Rain
3   1/9/1900  31.00     15.0  Sunny
4  1/12/1900  34.12     12.0   Rain

In [28]:
type(season.day[])

str

**4. Handling Missing Values**

Data can have missing values for a number of reasons such as observations that were not recorded and data corruption


fillna() is a funtion which is used to fill missing values

In [30]:
season.fillna(method = "ffill")

         day   temp  climate  event
0  1/12/2007  32.00      6.0   rain
1  5/15/2003  32.00      6.0  Sunny
2  6/10/2006  33.00      7.0   Rain
3   1/9/1900  31.00     15.0  Sunny
4  1/12/1900  34.12     12.0   Rain
5  1/25/1900  12.00     12.0   rain
6  1/25/1900  12.00    125.0  Sunny
7   1/7/1900  12.00    125.0   rain
8   1/3/2000  25.00    125.0   rain

In [31]:
season.fillna(method = "bfill")

         day   temp  climate  event
0  1/12/2007  32.00      6.0   rain
1  5/15/2003  33.00      7.0  Sunny
2  6/10/2006  33.00      7.0   Rain
3   1/9/1900  31.00     15.0  Sunny
4  1/12/1900  34.12     12.0   Rain
5  1/25/1900  12.00    125.0   rain
6  1/25/1900  25.00    125.0  Sunny
7   1/7/1900  25.00      NaN   rain
8   1/3/2000  25.00      NaN    NaN

In [ ]:
a = season.fillna('temp':0, 'climate':0, 'event':'No')
a

In [36]:
season.interpolate()

         day       temp  climate  event
0  1/12/2007  32.000000      6.0   rain
1  5/15/2003  32.500000      6.5  Sunny
2  6/10/2006  33.000000      7.0   Rain
3   1/9/1900  31.000000     15.0  Sunny
4  1/12/1900  34.120000     12.0   Rain
5  1/25/1900  12.000000     68.5   rain
6  1/25/1900  16.333333    125.0  Sunny
7   1/7/1900  20.666667    125.0   rain
8   1/3/2000  25.000000    125.0    NaN

In [ ]:
season.dropna()
season.dropna(how = "all") #how = all drops the rows where all the columns have NaN
season.dropna(how = "any") # how = any drops the rows where any the rows have NaN

In [37]:
from sklearn.preprocessing import scale

#### Handling Missing values using Scikit-learn

In [44]:
from sklearn.preprocessing import Imputer

In [40]:
imputer = Imputer(missing_values = 'NaN', strategy = "mean", axis = 0)

C:\Users\faiza\Anaconda3\lib\site-packages\sklearn\utils\deprecation.py:58: DeprecationWarning: Class Imputer is deprecated; Imputer was deprecated in version 0.20 and will be removed in 0.22. Import impute.SimpleImputer from sklearn instead.
  warnings.warn(msg, category=DeprecationWarning)

In [45]:
season

         day   temp  climate  event
0  1/12/2007  32.00      6.0   rain
1  5/15/2003    NaN      NaN  Sunny
2  6/10/2006  33.00      7.0   Rain
3   1/9/1900  31.00     15.0  Sunny
4  1/12/1900  34.12     12.0   Rain
5  1/25/1900  12.00      NaN   rain
6  1/25/1900    NaN    125.0  Sunny
7   1/7/1900    NaN      NaN   rain
8   1/3/2000  25.00      NaN    NaN

In [47]:
imputer = imputer.fit(season.iloc[:,1:3])

In [49]:
season.iloc[:,1:3] = imputer.transform(season.iloc[:,1:3])

In [50]:
season

         day       temp  climate  event
0  1/12/2007  32.000000      6.0   rain
1  5/15/2003  27.853333     33.0  Sunny
2  6/10/2006  33.000000      7.0   Rain
3   1/9/1900  31.000000     15.0  Sunny
4  1/12/1900  34.120000     12.0   Rain
5  1/25/1900  12.000000     33.0   rain
6  1/25/1900  27.853333    125.0  Sunny
7   1/7/1900  27.853333     33.0   rain
8   1/3/2000  25.000000     33.0    NaN

In [51]:
season.event.value_counts()

rain     3
Sunny    3
Rain     2
Name: event, dtype: int64

In [53]:
import pandas as pd
home = pd.read_csv(r'C:\\Users\\faiza\\Downloads\\Documents\\house.csv')
home.head()

          town   area   price
0    gachibowli   3200  55000
1      nizampet   3400  60000
2    gachibowli   3300  70000
3  secunderabad   3600  80000
4  secunderabad   4000  75500

#### Dummy Variables using LabelEncoder

In [55]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [ ]:
price.town = le.fit_transform(price.town)
price